#include <stdio.h>
#include <time.h>
#include <stdlib.h>

int main (){

    printf("---4_1---\n");

    int a;
    int i = 0;

    srand((unsigned)time(NULL));
    a = rand() % 10 + 1;

    printf("数：%d",a);

    for(i = 1;i <= a;i ++){
        printf("*");
    }

    printf("\n");

     /*-----------------------------------------------------------*/

     printf("---4_2---\n");

     int b;
     i = 1;

     b = rand() % 10 + 1;

     printf("数：%d",b);

     while(i <= b){
        printf("*");
        i ++;
     }

     printf("\n");

     /*-----------------------------------------------------------*/

     printf("---4_3---\n");

     int c;
     i = 1;

     c = rand() % 10 + 1;

     printf("数値：%d\n",c);

     do{
        printf("*");
        i ++;
     }while(i <= c);

     printf("\n");

    /*-----------------------------------------------------------*/
    printf("---4_4---\n");

    int d = 0;

    while(d <= 3){
      printf("a = %d\n",d);
      d ++;
    }

    printf("\n");

    /*-----------------------------------------------------------*/
    printf("---4_5---\n");

    int e;

    for(e = 0;e <=3;e ++){
      printf("a = %d\n",e);
    }
    printf("\n");

    /*-----------------------------------------------------------*/
    printf("---4_6---\n");

    int f = 3;

    while(f >= 0){
      printf("a = %d\n",f);
      f --;
    }
    printf("\n");

     /*-----------------------------------------------------------*/
     printf("---4_7---\n");

     int g;

     for(g = 3;g >= 0;g --){
      printf("a = %d\n",g);
     }

     printf("\n");

     /*-----------------------------------------------------------*/
     printf("---4_8---\n");

     int h;

     while(!(h == 10)){
      h = rand() % 10 + 1;
      printf("%d\n",h);
     }

     printf("終了します。\n");

     /*-----------------------------------------------------------*/
     printf("---4_9---\n");

     int j;

     while(!(j % 10 == 0)){
      j = rand() % 100 + 1;
      printf("%d\n",j);
     }

     printf("終了します。\n");

     /*-----------------------------------------------------------*/
     printf("---4_10---\n");

     int k;
     i = 0;

     for(i = 0;i < 5;i ++){
      k = rand() % 100 + 1;
      printf("%d\n",k);
     }

     printf("\n");

     /*-----------------------------------------------------------*/
     printf("---4_11---\n");

     int max = 0;
     int l;
     i = 0;

     for(i = 0;i < 5;i ++){
      l = rand() % 100 + 1;
      printf("%d\n",l);
      if(i == 0||l > max){
        max = l;
      } 
    }

     printf("最大値は%dです。\n",max);

     /*-----------------------------------------------------------*/
     printf("---4_12---\n");

     int m;
     i = 0;
     max = 0;

     for(i = 0;i < 5;i ++){
      m = rand() % 100 + 1;
      printf("%d\n",m);
      if(i == 0 || m < max){
        max = m;
      }
     }

     printf("最小値は%dです。\n",max);

     /*-----------------------------------------------------------*/
     printf("---4_13---\n");

     int n;
     i = 0;

     n = rand() % 10 + 1;
     printf("発生した数値：%d\n",n);

     if(n >= 5){
      while(n > 0){
        printf("★");
        n --;
      }
     }
     else{
      printf("発生した数値：%d\n",n);
     }
     printf("\n");

     /*-----------------------------------------------------------*/
     printf("---4_14---\n");

     int o;
     i = 0;

     o = rand() % 10 + 1;

     printf("発生した数値：%d\n",o);

     if(o % 2 == 0){
      while(o > 0){
        printf("★");
        o --;
      }
     }else{
      while(o > 0){
        printf("☆");
        o --;
      }
     }

     printf("\n");

     /*-----------------------------------------------------------*/
     printf("---4_15---\n");

     int p;
     i = 0;

     while(i < 100){
      i ++;
      printf("%d",i);
      printf(" ");
      if(i % 10 ==0){
        printf("\n");
      }
     }

     printf("\n");

     /*-----------------------------------------------------------*/
     printf("---4_16---\n");

     a = 0;
     b = 0;

     for(a = 1;a <= 9;a ++){
      for(b = 1;b < 9;b ++){
        printf("%d*%d=%d",b,a,b*a);
        printf(" ");
      }
      printf("\n");
     }

     /*-----------------------------------------------------------*/
     printf("---4_17---\n");

     a = 0;
     b = 0;

     for(a = 1;a <= 10;a ++){
      for(b = 1;b <= 10; b ++){
        if(a < b){
          printf("□");
        }else{
          printf("■");
        }
      }
      printf("\n");
     }

     /*-----------------------------------------------------------*/
     printf("---4_18---\n");

     a = 0;
     b = 0;

     for(a = 1;a <= 10;a ++){
      for(b = 1;b <= 10;b ++){
        if(a == b){
          printf("□");
        }else{
          printf("■");
        }
      }
      printf("\n");
     }











return 0;
}